{"pageProps":{"service":{"id":40,"imageLayer":"/images/icons/layer.svg","imageIcon":{"src":"/images/icons/icon-02.svg","width":"41","height":"24"},"iconColorClass":"gradient-color-05","title":"Innovative Designs","description":"We incorporate cutting-edge, aerodynamic designs, clever space management, and fashionable interiors to improve your bus's overall appearance and feel while staying ahead of industry trends. Our creative strategy guarantees optimal efficiency and comfort for both passengers and operators.","category":"Our values","slug":"our-values-4","process":{"title":"Our execution process","description":"Our comprehensive design strategy ensures a perfectly crafted design for your business.","strategies":[{"id":1,"title":"Structure","subtitle":"our four step process","description":"Gobind Coach Builders starts with a solid foundation. We use high-quality Galvanized Iron (GI) to construct the frame, chassis, floor, side panels, and roof. This ensures a durable and corrosion-resistant structure that can handle the demands of daily travel. The GI provides strength, longevity, and a cost-effective solution, ensuring your buses are built to last.","highlightColor":"extra04-color","image":"/images/process/process-01.JPG"},{"id":2,"title":"Paneling","subtitle":"our four step process","description":"After the robust structure is in place, Gobind Coach Builders focuses on the smooth and attractive exterior. We use GPSP sheets (Galvanized Pre-Painted Steel Sheets) for the body panels. These sheets offer a combination of strength, durability, and a beautiful finish. The galvanized coating provides corrosion resistance, while the pre-painted surface allows for a wide range of colors and designs, giving your buses a unique look.","highlightColor":"extra05-color","image":"/images/process/process-02.jpg"},{"id":3,"title":"Interior","subtitle":"our four step process","description":"Gobind Coach Builders knows that a comfortable interior is crucial for a pleasant journey. We use high-quality ABS sheets to create the interior panels, walls, and ceilings, ensuring a smooth and elegant finish. The ABS sheets are lightweight, durable, and easy to clean, making them ideal for the demanding environment of a bus interior.But it's not just about the basics. We also incorporate cool accessories to enhance the passenger experience. These might include stylish seat covers, modern lighting, comfortable flooring, and innovative storage solutions. We strive to create an inviting and functional space that passengers will love.","highlightColor":"extra06-color","image":"/images/process/process-03.jpg"},{"id":4,"title":"Final Finishing","subtitle":"our four step process","description":"This is where Gobind Coach Builders turns your buses into masterpieces. We pay attention to the smallest details, ensuring that every element is perfect. From the exterior paint job to the interior upholstery, we take pride in our craftsmanship. Our skilled team uses the latest tools and techniques to create a flawless finish that will impress your passengers and elevate your brand. We also conduct rigorous quality checks to ensure that every bus meets our high standards before it leaves our facility.","highlightColor":"extra07-color","image":"/images/process/process-04.jpg"}]}}},"__N_SSG":true}